/*
  Localizable.strings
  Grocy-SwiftUI

  Created by Georg Meissner on 13.11.20.
  
*/

// MARK: - Generic
"str.cancel" = "Cancelar";
"str.ok" = "Aceitar";
"str.confirm" = "Confirmar";
"str.delete" = "Apagar";
"str.edit" = "Editar";
"str.save" = "Guardar";
"str.search" = "Procurar";
"str.noSearchResult" = "Nenhum resultado de pesquisa encontrado.";
"str.day" = "Dia";
"str.days" = "Dias";
"str.refresh" = "Atualizar";
"str.close" = "Fechar";
"str.add" = "Adicionar";
"str.misc" = "Diversos";
"str.clear" = "Limpar";
"str.back" = "Voltar";
"str.retry" = "Tente novamente";
"str.failed" = "Falhou";
"str.none" = "Nada";
"str.error.connection" = "Sem conexão ao servidor.";
"str.error.api" = "Erro de API detetado.";
"str.error.other" = "Ocorreu um erro desconhecido.";
"str.error.logInfo" = "Por favor verifique o log para determinar o problema";
"str.time.unlimited" = "Ilimitado";
"str.sort" = "Filtrar";
"str.sort.category" = "Filtrar por categoria";
"str.sort.order" = "Filtrar por Ordem";
"str.sort.order.forward" = "Ascendente";
"str.sort.order.reverse" = "Descendente";
"str.group.category" = "Agrupar por";

// MARK: - Generic components
"str.double.invalid %@ %@" = "Isso não pode ser menor que %@ e precisa ser um número válido com max. %@ casas decimais";

// MARK: - Transactions
"tr.purchase" = "Comprar";
"tr.consume" = "Consumir";
"tr.opened" = "Aberto";
"tr.inventoryCorrection" = "Inventário ";
"tr.stockEditOld" = "Editar estoque (antigo)";
"tr.stockEditNew" = "Editar estoque (novo)";
"tr.transferFrom" = "Transferir de ";
"tr.transferTo" = "Transferir para";
"tr.selfProduction" = "Produção própria ";

// MARK: - Navigation
"str.nav.stockOverview" = "Visão Geral do Estoque";
"str.nav.shoppingList" = "Lista de Compras";
"str.nav.recipes" = "Receitas";
"str.nav.mealPlan" = "Plano de Refeições";
"str.nav.choresOverview" = "Visão Geral de Atividades";
"str.nav.tasks" = "Tarefas";
"str.nav.batteriesOverview" = "Visão Geral de Baterias";
"str.nav.equipment" = "Equipamento";
"str.nav.calendar" = "Calendário";
"str.nav.activities" = "Atividades";
"str.nav.purchase" = "Comprar";
"str.nav.consume" = "Consumir";
"str.nav.transfer" = "Transferir";
"str.nav.inventory" = "Estoque";
"str.nav.choreTracking" = "Acompanhamento de Atividades";
"str.nav.batteryTracking" = "Acompanhamento de Baterias";
"str.nav.md" = "Cadastros";
"str.nav.md.products" = "Produtos";
"str.nav.md.locations" = "Localizações";
"str.nav.md.stores" = "Lojas";
"str.nav.md.quantityUnits" = "Unidades de Quantidade";
"str.nav.md.productGroups" = "Grupos de Produtos";
"str.nav.md.chores" = "Atividades";
"str.nav.md.batteries" = "Baterias";
"str.nav.md.taskCategories" = "Categorias de Tarefas";
"str.nav.md.userFields" = "Campos do Usuário";
"str.nav.md.userEntities" = "Entidades do Usuário";
"str.nav.settings" = "Configurações";
"str.nav.userManagement" = "Gerenciamento de Usuários";
"str.nav.quickScan" = "Verificação Rápida";

// MARK: - Details
"str.details.title" = "Visão geral do produto";
"str.details.amount" = "Quantidade em Estoque:";
"str.details.stockValue" = "Valor do Estoque:";
"str.details.defaultLocation" = "Localização Padrão:";
"str.details.lastPurchaseDate" = "Última Compra:";
"str.details.lastUseDate" = "Último Uso:";
"str.details.lastPrice" = "Último Preço:";
"str.details.averagePrice" = "Preço Médio:";
"str.details.averageShelfLife" = "Prazo Médio de Validade:";
"str.details.spoilRate" = "Taxa de Deterioração:";
"str.details.relation %@ %@" = "%@ por %@";

"str.details.never" = "Nunca";
"str.details.unknown" = "Desconhecido";

"str.details.stockEntries" = "Entradas em estoque";
"str.details.stockJournal" = "Diário de estoque";
"str.details.edit" = "Editar produto";

// MARK: - Stock
"str.stock.stockOverview" = "Estoque Geral";
// Products, Summed Value
"str.stock.stockOverviewInfo %lld %@" = "%lld Produtos, valor total %@";
"str.stock.search" = "Procurar no Estoque";
"str.stock.empty" = "Nada em Estoque.";
"str.stock.location" = "Localização";
"str.stock.productGroup" = "Grupo";
"str.stock.all" = "Todos";
"str.stock.status" = "Status";
"str.stock.status.expiringSoon" = "Expira em breve";
"str.stock.status.overdue" = "Vencido";
"str.stock.status.expired" = "Expirado";
"str.stock.status.belowMinStock" = "Abaixo do Estoque Mínimo";
"str.stock.info.1expiringSoon %lld" = "1 produto vence dentro dos próximos %lld dias";
"str.stock.info.1overdue" = "1 produto está vencido";
"str.stock.info.1expired" = "1 produto está expirado";
"str.stock.info.1belowMinStock" = "1 produto está abaixo da quantidade mínima definida no estoque";
"str.stock.info.expiringSoon %lld %lld" = "%lld produtos vencem dentro dos próximos %lld dias";
"str.stock.info.overdue %lld" = "%lld produtos estão vencidos";
"str.stock.info.expired %lld" = "%lld produtos estão expirados";
"str.stock.info.belowMinStock %lld" = "%lld produtos estão abaixo da quantidade mínima definida no estoque";
"str.stock.info.opened %@" = "%@ aberto";
"str.stock.info.onShoppingList" = "Este produto está atualmente em uma lista de compras.";

"str.stock.entry.description.notOpened %@ %@ %@" = "Quantidade: %@; Vence em %@; Comprado em %@; Não aberto";
"str.stock.entry.description.opened %@ %@ %@" = "Quantidade: %@; Vence em %@; Comprado em %@; Aberto";
"str.stock.entry.status.notOpened" = "Fechado";
"str.stock.entry.status.opened" = "Aberto";

"str.stock.tbl.product" = "Produtos";
"str.stock.tbl.productGroup" = "Grupo de produtos";
"str.stock.tbl.amount" = "Quantia";
"str.stock.tbl.value" = "Valor";
"str.stock.tbl.nextDueDate" = "Próxima data de vencimento";
"str.stock.tbl.caloriesPerStockQU" = "Calorias (Por unidade de quantidade em estoque)";
"str.stock.tbl.calories" = "Calorias";
"str.stock.tbl.lastPurchased" = "Comprador pela última vez";
"str.stock.tbl.lastPrice" = "Último Preço";
"str.stock.tbl.minStockAmount" = "Quantidade em estoque abaixo do mínimo";
"str.stock.tbl.productDescription" = "Descrição do produto";
"str.stock.tbl.parentProduct" = "Produto Principal";
"str.stock.tbl.defaultLocation" = "Localização Padrão:";
"str.stock.tbl.productPicture" = "Foto do Produto";
"str.stock.tbl.action.all" = "Todos";
"str.stock.tbl.action.consume %@" = "Consumir %@";
"str.stock.tbl.action.consume.all %@" = "Consumir todos %@ do estoque";
"str.stock.tbl.action.consume.all.confirm %@ %@" = "Deseja realmente consumir (%@) %@ do estoque?";
"str.stock.tbl.action.consume.open %@" = "Atribuir %@ como aberto";
"str.stock.tbl.action.successConsumeOne %@" = "1 %@ consumido";
"str.stock.tbl.action.successConsumeAll %@" = "Todos %@ consumido";
"str.stock.tbl.action.successOpenOne %@" = "1 %@ aberto";
"str.stock.tbl.action.successConsumeAllSpoiled %@" = "Todos %@ estragados";
"str.stock.tbl.action.fail" = "Falha na ação";

"str.stock.tbl.menu.addToShL" = "Adicionar à Lista de Compras";
"str.stock.tbl.menu.consumeAsSpoiled %@" = "Consumir %@ como estragado";
"str.stock.tbl.menu.searchRecipes" = "Procurar receitas que contenham este produto";

"str.stock.product.amount" = "Quantidade";
"str.stock.product.amount.factored %@ %@" = "Isso equivale a %@ %@";
"str.stock.product.amount.locMax" = "Essa quantidade não está disponível na localização selecionada";
"str.stock.product.quantityUnit" = "Unidade de Quantidade";
"str.stock.product.quantityUnit.required" = "Uma unidade de quantidade é necessária";

"str.stock.buy" = "Comprar";
"str.stock.buy.product" = "Produto";
"str.stock.buy.product.buy" = "Comprar produto";
"str.stock.buy.product.buy.success %@" = "%@ comprado";
"str.stock.buy.product.buy.fail" = "Compra falhou";
"str.stock.buy.product.required" = "Você deve selecionar um produto";
"str.stock.buy.product.dueDate" = "Vencimento";
"str.stock.buy.product.dueDate.required" = "Data de vencimento é obrigatória";
"str.stock.buy.product.doesntSpoil" = "Nunca vence";
"str.stock.buy.product.price" = "Preço";
"str.stock.buy.product.price.invalid" = "Isso não pode ser inferior a 0,01 e precisa ser um número válido com no máximo 2 casas decimais";
"str.stock.buy.product.price.unitPrice %@" = "Preço %@";
"str.stock.buy.product.price.unitPrice" = "Preço unitário";
"str.stock.buy.product.price.totalPrice" = "Preço total";
"str.stock.buy.product.price.relation %@ %@" = "significa %@ por %@";
"str.stock.buy.product.store" = "Loja";
"str.stock.buy.product.location" = "Localização";
"str.stock.buy.product.location.default %@" = "%@ (Localização padrão)";
"str.stock.buy.product.note" = "Observação";
"str.stock.buy.product.selfProduction" = "Produção própria";

"str.stock.consume" = "Consumir";
"str.stock.consume.product" = "Produto";
"str.stock.consume.product.consume" = "Consumir produto";
"str.stock.consume.product.consume.success %@" = "%@ consumido";
"str.stock.consume.product.consume.fail" = "Falha ao consumir";
"str.stock.consume.product.open" = "Marcar como aberto";
"str.stock.consume.product.open.success %@" = "%@ aberto";
"str.stock.consume.product.open.fail" = "Falha ao abrir";
"str.stock.consume.product.required" = "Você deve selecionar um produto";
"str.stock.consume.product.location" = "Localização";
"str.stock.consume.product.location.required" = "Uma localização é necessária";
"str.stock.consume.product.location.default %@" = "%@ (Localização padrão)";
"str.stock.consume.product.details" = "Detalhes";
"str.stock.consume.product.spoiled" = "Estragado";
"str.stock.consume.product.useStockEntry" = "Usar um item de estoque específico";
"str.stock.consume.product.useStockEntry.description" = "O primeiro item nesta lista seria escolhido pela regra padrão que é Aberto primeiro, depois vencimento mais próximo primeiro, depois o primeiro que entrou primeiro";
"str.stock.consume.product.stockEntry" = "Entrada de Estoque";
"str.stock.consume.product.recipe" = "Receita";
"str.stock.consume.product.recipe.info" = "Isso é apenas para fins estatísticos";

"str.stock.transfer" = "Transferir";
"str.stock.transfer.product" = "Produto";
"str.stock.transfer.product.transfer" = "Transferir produto";
"str.stock.transfer.product.transfer.success %@" = "%@ transferido";
"str.stock.transfer.product.transfer.fail" = "Falha na transferência";
"str.stock.transfer.product.required" = "Você precisa selecionar um produto";
"str.stock.transfer.product.locationFrom" = "Do local";
"str.stock.transfer.product.locationFrom.required" = "Um local é obrigatório";
"str.stock.transfer.product.locationTo" = "Para o local";
"str.stock.transfer.product.locationTo.required" = "Um local é obrigatório";
"str.stock.transfer.product.locationTo.same" = "Isso não pode ser o mesmo que o local";
"str.stock.transfer.product.shouldNotBeFrozen" = "Este produto não deve estar congelado";
"str.stock.transfer.product.useStockEntry" = "Use um item de estoque específico";
"str.stock.transfer.product.useStockEntry.description" = "O primeiro item nesta lista seria escolhido pela regra padrão que é Aberto primeiro, depois vencimento mais próximo primeiro, depois o primeiro que entrou primeiro";
"str.stock.transfer.product.stockEntry" = "Entrada de Estoque";

"str.stock.inventory" = "Inventário";
"str.stock.inventory.product" = "Produto";
"str.stock.inventory.product.inventory" = "Realizar inventário";
"str.stock.inventory.product.inventory.success %@" = "%@ inventariado";
"str.stock.inventory.product.inventory.fail" = "Falha no inventário";
"str.stock.inventory.product.amount.lower %@" = "Isso significa que %@ será removido do estoque";
"str.stock.inventory.product.amount.higher %@" = "Isso significa que %@ será adicionado ao estoque";
"str.stock.inventory.product.amount.equal" = "A quantidade selecionada é igual à quantidade em estoque.";
"str.stock.inventory.product.dueDate" = "Data de vencimento";
"str.stock.inventory.product.dueDate.info" = "Isso se aplicará aos produtos adicionados";
"str.stock.inventory.product.dueDate.required" = "Uma data de vencimento é obrigatória";
"str.stock.inventory.product.neverOverdue" = "Nunca vence";
"str.stock.inventory.product.price" = "Preço";
"str.stock.inventory.product.price.info" = "Por unidade de quantidade de estoque";
"str.stock.inventory.product.price.invalid" = "Isso não pode ser inferior a 0,01 e precisa ser um número válido com no máximo 2 casas decimais";
"str.stock.inventory.product.store" = "Loja";
"str.stock.inventory.product.location" = "Localização";
"str.stock.inventory.product.location.info" = "Isso se aplicará aos produtos adicionados";
"str.stock.inventory.product.location.required" = "Uma localização é obrigatória";

"str.stock.journal" = "Diário de Estoque";
"str.stock.journal.summary" = "Resumo do Diário de Estoque";
"str.stock.journal.empty" = "Nenhuma transação encontrada.";
"str.stock.journal.undo" = "Desfazer transação";
"str.stock.journal.undo.failed" = "Falha ao desfazer transação";
"str.stock.journal.undo.date %@" = "Desfeito em %@";
"str.stock.journal.product" = "Produto";
"str.stock.journal.product.info %@" = "Produto: %@";
"str.stock.journal.amount.info %@" = "Quantidade: %@";
"str.stock.journal.transactionTime.info %@" = "Tempo da transação: %@";
"str.stock.journal.transactionType" = "Tipo de transação";
"str.stock.journal.transactionType.info %@" = "Tipo de transação: %@";
"str.stock.journal.location" = "Localização";
"str.stock.journal.location.info %@" = "Localização: %@";
"str.stock.journal.user" = "Usuário";
"str.stock.journal.user.info %@" = "Feito por: %@";

"str.stock.entries" = "Entradas de Estoque";
"str.stock.entries.empty" = "Nenhum registro correspondente encontrado";
"str.stock.entries.product %@" = "Produto: %@";
"str.stock.entries.amount %@" = "Quantidade: %@";
"str.stock.entries.dueDate %@" = "Data de vencimento: %@";
"str.stock.entries.location %@" = "Localização: %@";
"str.stock.entries.store %@" = "Loja: %@";
"str.stock.entries.price %@" = "Preço: %@";
"str.stock.entries.purchasedDate %@" = "Data de compra: %@";
"str.stock.entries.note %@" = "Observação: %@";
"str.stock.entry.edit" = "Editar entrada";
"str.stock.entry.save" = "Salvar entrada";
"str.stock.entry.consume" = "Consumir esta entrada de estoque";
"str.stock.entry.open" = "Marcar esta entrada de estoque como aberta";

// MARK: - Shopping List
"str.shL" = "Lista de Compras";
"str.shL.manage" = "Gerencias lista de compras";
"str.shL.new" = "Nova lista de compras";
"str.shL.edit" = "Alterar lista de compras";
"str.shL.delete" = "Deletar lista de compras";
"str.shL.delete.confirm" = "Deseja deletar esta lista de compras?";
"str.shL.print" = "Imprimir";
"str.shL.amount" = "Preço";
"str.shL.ungrouped" = "Desagrupado";

"str.shL.form.new" = "Criar lista de compras";
"str.shL.form.edit" = "Editar lista de compras";
"str.shL.form.name" = "Nome";
"str.shL.form.name.required" = "Um nome é obrigatório";
"str.shL.form.name.exists" = "Nome já existe";
"str.shL.form.save" = "Salvar";
"str.shL.form.save.failed" = "Falha ao salvar";

"str.shL.action.addItem" = "Adicionar item";
"str.shL.action.clearList" = "Limpar lista";
"str.shL.action.clearList.confirm" = "Deseja limpar a lista de compras?";
"str.shL.action.clearDone" = "Limpeza dos itens concluída";
"str.shL.action.addListItemsToStock" = "Adicionar todos os itens ao estoque";
"str.shL.action.addBelowMinStock" = "Adicionar produtos que estão abaixo da quantidade mínima definida no estoque";
"str.shL.action.addOverdue" = "Adicionar produtos vencidos/expirados";
"str.shL.action.failed" = "Falha ao executar";

"str.shL.filter.status" = "Situação";
"str.shL.filter.reset" = "Limpar filtro";
"str.shL.filter.all" = "Todos";
"str.shL.filter.belowMinStock" = "Abaixo da quantidade mínima definida no estoque";
"str.shL.filter.done" = "Apenas itens concluídos";
"str.shL.filter.undone" = "Apenas itens não concluídos";
"str.shL.filter.info.1belowMinStock" = "1 produto está abaixo da quantidade mínima definida no estoque";
"str.shL.filter.info.belowMinStock %lld" = "%lld produtos estão abaixo da quantidade mínima definida no estoque";
"str.shL.filter.info.1done" = "1 entrada está concluída";
"str.shL.filter.info.done %lld" = "%lld entradas estão concluídas";
"str.shL.filter.info.1undone" = "1 entrada não está concluída";
"str.shL.filter.info.undone %lld" = "%lld entradas não estão concluídas";

"str.shL.entryForm.new.title" = "Criar item de lista de compras";
"str.shL.entryForm.edit.title" = "Editar item de lista de compras";
"str.shL.entryForm.save.failed" = "Falha ao salvar.";
"str.shL.entryForm.shoppingList" = "Lista de compras";
"str.shL.entryForm.product" = "Produto";
"str.shL.entryForm.amount" = "Quantidade";
"str.shL.entryForm.quantityUnit" = "Unidade de quantidade";
"str.shL.entryForm.note" = "Observações";

"str.shL.entry.done" = "Marcar este item como concluído";
"str.shL.entry.edit" = "Editar este item";
"str.shL.entry.delete" = "Excluir este item";
"str.shL.entry.delete.confirm" = "Deseja excluir este item?";
"str.shL.entry.add %@" = "Adicionar %@ ao estoque";
"str.shL.entry.info.amount %@" = "Quantidade: %@";

// MARK: - Recipes
"str.recipes" = "Receitas";
"str.recipes.name" = "Nome";
"str.recipes.dueScore" = "Pontuação de Vencimento";
"str.recipes.dueScore.hint" = "Quanto maior esse número, mais ingredientes atualmente em estoque estão próximos do vencimento, vencidos ou já expirados";
"str.recipes.fulfillment" = "Requisitos atendidos";
"str.recipes.fulfillment.enough" = "Suficiente em estoque";
"str.recipes.fulfillment.notEnough" = "Insuficiente em estoque";
"str.recipes.fulfillment.notEnough %lld" = "Insuficiente em estoque, %lld ingredientes faltando";
"str.recipes.fulfillment.notEnough.shL" = "Insuficiente em estoque, mas já está na lista de compras";
"str.recipes.fulfillment.notEnough.shLAll %lld" = "Insuficiente em estoque, %lld ingredientes faltando, mas já estão na lista de compras";
"str.recipes.fulfillment.notEnough.shLSome %lld %lld" = "Insuficiente em estoque, %lld faltando, %lld já na lista de compras";

// MARK: - Master Data
"str.md.masterData" = "Cadastros";
"str.md.description" = "Descrição";
"str.md.search" = "Buscar";
"str.md.new.success" = "Entrada adicionada";
"str.md.new.fail" = "Falha ao adicionar";
"str.md.edit.success" = "Edição bem-sucedida";
"str.md.edit.fail" = "Falha na edição";
"str.md.delete.success" = "Exclusão bem-sucedida";
"str.md.delete.fail" = "Falha na exclusão";

// MD Product
"str.md.products" = "Produtos";
"str.md.product" = "Produto";
"str.md.products.empty" = "Nenhum produto encontrado.";
"str.md.product.rowLocation %@" = "Localização: %@";
"str.md.product.rowProductGroup %@" = "Grupo de produtos: %@";
"str.md.product.new" = "Criar Produto";
"str.md.product.edit" = "Editar Produto";
"str.md.product.save" = "Salvar Produto";
"str.md.product.info" = "Informações do Produto";
"str.md.product.notOnServer" = "O produto não está no servidor";
"str.md.product.delete" = "Apagar este Produto";
"str.md.product.delete.confirm" = "Tem certeza de que deseja apagar este produto?";
"str.md.product.name" = "Nome do Produto";
"str.md.product.name.required" = "O nome é obrigatório";
"str.md.product.name.exists" = "O nome já existe";
// optional properties
"str.md.product.category.optionalProperties" = "Propriedade opcional";
"str.md.product.category.optionalProperties.description" = "Estado, produto principal, descrição, grupo de produtos, energia, imagem";
"str.md.product.active" = "Ativo";
"str.md.product.parentProduct" = "Produto principal";
"str.md.product.description" = "Descrição";
"str.md.product.productGroup" = "Grupo do produto";
"str.md.product.calories" = "Energia (kcal)";
"str.md.product.calories.info" = "Por unidade de quantidade em estoque";
"str.md.product.dontShowOnStockOverview" = "Nunca mostrar na visão geral do estoque";
"str.md.product.dontShowOnStockOverview.info" = "A página de visão geral do estoque lista todos os produtos que estão atualmente em estoque ou abaixo da quantidade mínima de estoque - ative isso para ocultar este produto sempre";
"str.md.product.picture" = "Foto do produto";
"str.md.product.picture.saved" = "Foto do produto encontrada";
"str.md.product.picture.none" = "Produto sem foto";
"str.md.product.picture.add.file" = "Selecione uma foto para esse produto do arquivo";
"str.md.product.picture.add.gallery" = "Selecionar foto do produto da galeria";
"str.md.product.picture.add.camera" = "Adicionar foto do produto da câmera";
"str.md.product.picture.upload" = "Carregar foto do produto";
"str.md.product.picture.delete" = "Apagar foto do produto";
// default locations
"str.md.product.category.defaultLocations" = "Localizações padrão";
"str.md.product.category.defaultLocations.description" = "Localização, Loja";
"str.md.product.location" = "Localização padrão";
"str.md.product.location.required" = "É necessária uma localização";
"str.md.product.location.consume" = "Local de consumo padrão";
"str.md.product.location.consume.info" = "Entradas de estoque neste local serão consumidas primeiro";
"str.md.product.location.consume.moveOnOpen" = "Mover ao abrir";
"str.md.product.location.consume.moveOnOpen.info" = "Quando ativado, ao marcar este produto como aberto, a quantidade correspondente será movida para o local de consumo padrão";
"str.md.product.store" = "Loja padrão";
// due date
"str.md.product.category.dueDate" = "Data de vencimento";
"str.md.product.category.dueDate.description" = "Tipo, dias padrão; após abrir, congelar, descongelar";
"str.md.product.dueType" = "Tipo de data de vencimento";
"str.md.product.dueType.info" = "Com base no tipo selecionado, o destaque na página de visão geral do estoque será diferente";
"str.md.product.dueType.bestBefore" = "Data de melhor antes";
"str.md.product.dueType.bestBefore.info" = "Significa que o produto ainda pode ser consumido com segurança após atingir sua data de vencimento";
"str.md.product.dueType.expires" = "Data de validade";
"str.md.product.dueType.expires.info" = "Significa que o produto não é seguro para consumo após atingir sua data de vencimento";
"str.md.product.defaultDueDays" = "Dias de vencimento padrão";
"str.md.product.defaultDueDays.info" = "Para compras, essa quantidade de dias será adicionada à data atual para a sugestão de data de vencimento (-1 significa que este produto nunca estará vencido)";
"str.md.product.defaultDueDaysAfterOpen" = "Dias de vencimento padrão após abrir";
"str.md.product.defaultDueDaysAfterOpen.info" = "Quando este produto for marcado como aberto, a data de vencimento será substituída por hoje + esta quantidade de dias (um valor de 0 desativa isso)";
"str.md.product.defaultDueDaysAfterFreezing" = "Dias de vencimento padrão após congelar";
"str.md.product.defaultDueDaysAfterFreezing.info" = "Ao mover este produto para um local de freezer (quando congelando), a data de vencimento será substituída por hoje + esta quantidade de dias";
"str.md.product.defaultDueDaysAfterFreezing.invalid" = "Isso não pode ser menor que -1 e precisa ser um número válido com no máximo 0 casas decimais";
"str.md.product.defaultDueDaysAfterThawing" = "Dias de vencimento padrão após descongelar";
"str.md.product.defaultDueDaysAfterThawing.info" = "Ao mover este produto de um local de freezer (quando descongelando), a data de vencimento será substituída por hoje + esta quantidade de dias";
"str.md.product.defaultDueDaysAfterThawing.invalid" = "Isso não pode ser menor que 0 e precisa ser um número válido com no máximo 0 casas decimais";
// quantity units
"str.md.product.category.quantityUnits" = "Unidades de Quantidade";
"str.md.product.category.quantityUnits.description" = "Estoque, Compra";
"str.md.product.quStock" = "Unidade de Estoque";
"str.md.product.quStock.info" = "A unidade de estoque não pode ser alterada após a primeira compra";
"str.md.product.quStock.required" = "Uma unidade de quantidade é necessária";
"str.md.product.quPurchase" = "Unidade de quantidade padrão para compra";
"str.md.product.quPurchase.info" = "Esta é a unidade de quantidade padrão usada ao adicionar este produto à lista de compras";
"str.md.product.quPurchase.required" = "Uma unidade de quantidade é necessária";
"str.md.product.quConsume" = "Unidade de quantidade padrão para consumo";
"str.md.product.quConsume.info" = "Esta é a unidade de quantidade padrão usada ao consumir este produto";
"str.md.product.quConsume.required" = "É necessária uma unidade de quantidade";
"str.md.product.quPrice" = "Unidade de quantidade para preços";
"str.md.product.quPrice.info" = "Ao exibir preços para este produto, eles estarão relacionados com esta unidade de quantidade";
"str.md.product.quPrice.required" = "É necessária uma unidade de quantidade";
// amount
"str.md.product.category.amount" = "Quantidades";
"str.md.product.category.amount.description" = "Estoque mínimo, Consumo rápido, Fator, Peso tara";
"str.md.product.minStockAmount" = "Quantidade mínima em estoque ";
"str.md.product.cumulateMinStockAmountOfSubProducts" = "Acumular quantidade mínima de subprodutos ";
"str.md.product.cumulateMinStockAmountOfSubProducts.info" = "Se ativado, a quantidade mínima de subprodutos será acumulada neste produto, o que significa que o subproduto nunca estará faltando, apenas este produto";
"str.md.product.quickConsumeAmount" = "Quantidade de Consumo Rápido";
"str.md.product.quickConsumeAmount.info" = "Essa quantidade é usada para o botão de \"consumo rápido\" na página de visão geral do estoque (relacionado à unidade de quantidade do estoque)";
"str.md.product.quickOpenAmount" = "Quantidade de Abertura Rápida";
"str.md.product.quickOpenAmount.info" = "Essa quantidade é usada para o botão de \"abertura rápida\" na página de visão geral do estoque (relacionado à unidade de quantidade do estoque)";
"str.md.product.enableTareWeightHandling" = "Ativar manipulação de peso tara";
"str.md.product.enableTareWeightHandling.info" = "Isso é útil, por exemplo, para farinha em potes - ao comprar/consumir/inventariar, você sempre pesa o pote inteiro, a quantidade a ser registrada é então calculada automaticamente com base no que está em estoque e no peso tara definido abaixo";
"str.md.product.tareWeight" = "Peso tara";
"str.md.product.notCheckStockFulfillmentForRecipes" = "Desativar verificação de cumprimento de estoque para este ingrediente";
"str.md.product.notCheckStockFulfillmentForRecipes.info" = "Isso será usado como configuração padrão ao adicionar este produto como um ingrediente de receita";
"str.md.product.treatOpenedAsOutOfStock" = "Tratar aberto como fora de estoque";
"str.md.product.treatOpenedAsOutOfStock.hint" = "Quando ativado, os itens abertos serão contados como faltando para calcular se este produto está abaixo de sua quantidade mínima em estoque";
"str.md.product.shouldNotBeFrozen" = "Não deve ser congelado";
"str.md.product.shouldNotBeFrozen.hint" = "Quando ativado, ao mover este produto para uma localização de freezer (ao congelá-lo), um aviso será exibido";
"str.md.product.noOwnStock" = "Desativar estoque próprio";
"str.md.product.noOwnStock.hint" = "Quando ativado, este produto não poderá ter estoque próprio, o que significa que não será selecionável para compra (útil para produtos principais que são apenas usados como uma visualização de resumo/total dos produtos filhos)";

"str.md.barcodes" = "Códigos de Barras";
"str.md.barcode" = "Código de Barras";
"str.md.barcodes.empty" = "Sem Código de Barras";
"str.md.barcode.new" = "Adicionar Código de Barras";
"str.md.barcode.edit" = "Alterar Código de Barras";
"str.md.barcode.save" = "Salvar Código de Barras";
"str.md.barcode.for %@" = "Código de Barras para %@";
"str.md.barcode.barcode" = "Código de Barras";
"str.md.barcode.barcode.required" = "É necessário um código de barras";
"str.md.barcode.barcode.invalid" = "O código de barras é inválido ou já está em uso.";
"str.md.barcode.amount" = "Quantidade";
"str.md.barcode.quantityUnit" = "Unidade de quantidade";
"str.md.barcode.store" = "Loja";
"str.md.barcode.note" = "Nota";
"str.md.barcode.info.amount %@" = "Quantidade: %@";
"str.md.barcode.info.store %@" = "Loja: %@";
"str.md.barcode.delete" = "Deletar Código de Barras";
"str.md.barcode.delete.confirm" = "Você realmente deseja deletar este código de barras?";

"str.md.locations" = "Locais";
"str.md.location" = "Local";
"str.md.locations.empty" = "Nenhum local encontrado.";
"str.md.location.new" = "Novo local";
"str.md.location.edit" = "Editar local";
"str.md.location.save" = "Salvar local";
"str.md.location.info" = "Informações do local";
"str.md.location.name" = "Local";
"str.md.location.name.required" = "Um nome é obrigatório";
"str.md.location.name.exists" = "Nome já existe";
"str.md.location.freezer" = "Congelador";
"str.md.location.isFreezing" = "é um congelador";
"str.md.location.isFreezing.description" = "Ao mover um produto de/para um local de congelamento, a data de validade do produto é ajustada automaticamente de acordo com as configurações do produto";
"str.md.location.delete" = "Apagar este local";
"str.md.location.delete.confirm" = "Deseja realmente apagar este local?";

"str.md.stores" = "Lojas";
"str.md.store" = "Lojas";
"str.md.stores.empty" = "Nenhuma loja encontrada.";
"str.md.store.new" = "Nova loja";
"str.md.store.edit" = "Alterar Loja";
"str.md.store.save" = "Salvar loja";
"str.md.store.info" = "Informações da loja";
"str.md.store.name" = "Loja";
"str.md.store.name.required" = "Um nome é obrigatório";
"str.md.store.name.exists" = "Nome já existe";
"str.md.store.delete" = "Apagar essa loja";
"str.md.store.delete.confirm" = "Deseja apagar essa loja?";

"str.md.quantityUnits" = "Unidades de quantidade";
"str.md.quantityUnit" = "Unidade de quantidade";
"str.md.quantityUnits.empty" = "Nenhuma unidade de quantidade encontrada.";
"str.md.quantityUnit.new" = "Nova unidade de quantidade";
"str.md.quantityUnit.edit" = "Editar unidade de quantidade";
"str.md.quantityUnit.save" = "Salvar unidade de quantidade";
"str.md.quantityUnit.info" = "Informações da unidade de quantidade";
"str.md.quantityUnit.name" = "Nome (no singular)";
"str.md.quantityUnit.name.required" = "Um nome é obrigatório";
"str.md.quantityUnit.name.exists" = "Nome já existe";
"str.md.quantityUnit.namePlural" = "Nome (no plural)";
"str.md.quantityUnit.delete" = "Apagar esta unidade de quantidade";
"str.md.quantityUnit.delete.confirm" = "Deseja realmente apagar esta unidade de quantidade?";
"str.md.quantityUnit.conversions" = "Conversões padrão";
"str.md.quantityUnit.conversions.hint %@" = "%@ é igual a...";
"str.md.quantityUnit.conversion.new" = "Criar conversão de QU";
"str.md.quantityUnit.conversion.edit" = "Editar conversão de QU";
"str.md.quantityUnit.conversion.defaultFor %@" = "Padrão para QU %@";
"str.md.quantityUnit.conversion.quFrom" = "Unidade de quantidade de";
"str.md.quantityUnit.conversion.quTo" = "Unidade de quantidade para";
"str.md.quantityUnit.conversion.quTo.exists" = "Essa conversão já existe";
"str.md.quantityUnit.conversion.factor" = "Fator";
"str.md.quantityUnit.conversion.means %@ %@" = "Isso significa que %@ é igual a %@";
"str.md.quantityUnit.conversion.createInverse" = "Criar conversão inversa de QU";

"str.md.productGroups" = "Grupos de produtos";
"str.md.productGroup" = "Grupo";
"str.md.productGroups.empty" = "Nenhum grupo de produto encontrado.";
"str.md.productGroup.new" = "Criar grupo de produto";
"str.md.productGroup.edit" = "Editar grupo de produto";
"str.md.productGroup.save" = "Salvar grupo de produto";
"str.md.productGroup.info" = "Informações do grupo de produto";
"str.md.productGroup.name" = "Nome do grupo de produto";
"str.md.productGroup.name.required" = "Um nome é obrigatório";
"str.md.productGroup.name.exists" = "Nome já existe";
"str.md.productGroup.delete" = "Apagar este grupo de produto";
"str.md.productGroup.delete.confirm" = "Deseja realmente apagar este grupo de produto?";

"str.md.chores" = "Tarefas domésticas";
"str.md.batteries" = "Baterias";

"str.md.taskCategories" = "Categorias de tarefas";
"str.md.taskCategory" = "Categoria de tarefa";
"str.md.taskCategories.empty" = "Nenhuma categoria de tarefa encontrada.";
"str.md.taskCategory.new" = "Criar categoria de tarefa";
"str.md.taskCategory.edit" = "Editar categoria de tarefa";
"str.md.taskCategory.save" = "Salvar categoria de tarefa";
"str.md.taskCategory.info" = "Informações da categoria de tarefa";
"str.md.taskCategory.name" = "Nome da categoria de tarefa";
"str.md.taskCategory.name.required" = "Um nome é obrigatório";
"str.md.taskCategory.name.exists" = "Nome já existe";
"str.md.taskCategory.delete" = "Excluir esta categoria de tarefa";
"str.md.taskCategory.delete.confirm" = "Tem certeza de que deseja excluir esta categoria de tarefa?";

"str.md.userFields" = "Campos do usuário";
"str.md.userField" = "Campo do usuário";
"str.md.userFields.empty" = "Nenhum campo do usuário encontrado.";
"str.md.userFields.rowName %@" = "Nome: %@";
"str.md.userFields.rowEntity %@" = "Entidade: %@";
"str.md.userFields.rowType %@" = "Tipo: %@";
"str.md.userField.new" = "Criar campo do usuário";
"str.md.userField.edit" = "Editar campo do usuário";
"str.md.userField.save" = "Salvar campo do usuário";
"str.md.userField.entity" = "Entidade";
"str.md.userField.entity.required" = "É necessário uma entidade";
"str.md.userField.name" = "Nome";
"str.md.userField.name.info" = "Este é o nome interno do campo, por exemplo, para a API";
"str.md.userField.name.required" = "Isso é obrigatório e só pode conter letras e números";
"str.md.userField.name.invalid" = "Isso é obrigatório e só pode conter letras e números";
"str.md.userField.caption" = "Legenda";
"str.md.userField.caption.info" = "Isso é usado para exibir o campo na interface";
"str.md.userField.caption.required" = "Uma legenda é obrigatória";
"str.md.userField.sortNumber" = "Número de classificação";
"str.md.userField.sortNumber.info" = "Múltiplos campos do usuário serão ordenados por esse número no formulário de entrada";
"str.md.userField.sortNumber.invalid" = "Isso não pode ser menor que 0 e precisa ser um número válido com no máximo 0 casas decimais";
"str.md.userField.type" = "Tipo";
"str.md.userField.type.required" = "É necessário um tipo";
"str.md.userField.showAsColumnInTables" = "Exibir como coluna em tabelas";
"str.md.userField.delete" = "Excluir este campo do usuário";
"str.md.userField.delete.confirm" = "Você realmente deseja excluir este campo do usuário?";

"str.md.userField.type.textSingleLine" = "Texto (única linha)";
"str.md.userField.type.textMultiLine" = "Texto (múltiplas linhas)";
"str.md.userField.type.numberIntegral" = "Número (inteiro)";
"str.md.userField.type.numberDezimal" = "Número (decimal)";
"str.md.userField.type.date" = "Data (sem hora)";
"str.md.userField.type.dateTime" = "Data e Hora";
"str.md.userField.type.checkbox" = "Confirmação";
"str.md.userField.type.presetList" = "Lista de seleção (um item pode ser selecionado)";
"str.md.userField.type.presetChecklist" = "Lista de seleção (vários itens podem ser selecionados)";
"str.md.userField.type.link" = "Link";
"str.md.userField.type.file" = "Arquivo";
"str.md.userField.type.image" = "Imagem";

"str.md.userEntities" = "Entidades de Usuário";
"str.md.userEntity" = "Entidade de Usuário";
"str.md.userEntities.empty" = "Nenhuma entidade de usuário encontrada.";
"str.md.userEntity.new" = "Nova entidade de usuário";
"str.md.userEntity.edit" = "Editar entidade de usuário";
"str.md.userEntity.save" = "Salvar entidade de usuário";
"str.md.userEntity.info" = "Informações da entidade de usuário";
"str.md.userEntity.name" = "Nome da entidade de usuário";
"str.md.userEntity.name.required" = "Isso é obrigatório e só pode conter letras e números";
"str.md.userEntity.name.exists" = "Nome já existe";
"str.md.userEntity.caption" = "Legenda";
"str.md.userEntity.caption.required" = "Uma legenda é obrigatória";
"str.md.userEntity.description" = "Descrição";
"str.md.userEntity.showInSideBarMenu" = "Mostrar no menu da barra lateral";
"str.md.userEntity.iconCSSClass" = "Classe CSS do ícone";
"str.md.userEntity.iconCSSClass.example" = "Por exemplo, \"fas fa-smile\"";
"str.md.userEntity.delete" = "Excluir entidade de usuário";
"str.md.userEntity.delete.confirm" = "Você realmente deseja excluir esta entidade de usuário?";

// MARK: - Settings
"str.settings" = "Configurações";
"str.settings.logout" = "Sair do servidor";
"str.settings.loggedInAs %@" = "Conectado como usuário %@";
"str.settings.info" = "Informações sobre o Grocy-Server";
"str.settings.info.version %@" = "Versão do Grocy %@";
"str.settings.info.grocyVersion %@" = "Versão: %@";
"str.settings.info.grocyRLSDate %@" = "Data de lançamento: %@";
"str.settings.info.grocyPHPVersion %@" = "PHP Versão: %@";
"str.settings.info.grocySQLiteVersion %@" = "SQLite Versão: %@";
"str.settings.info.openInBrowser" = "Abra o navegador (para atualizar o banco de dados)";
"str.settings.codeTypes" = "Configuração de códigos de barras";
"str.settings.about" = "Sobre esse aplicativo";
"str.settings.about.thanks" = "Quero agradecer a Bernd Bestel pelo desenvolvimento de Grocy. Sem ele, este aplicativo seria impossível.";
"str.settings.about.version" = "Versão";
"str.settings.about.version.supported" = "Suportado";
"str.settings.about.version.notSupported" = "Não suportado";
"str.settings.about.developer" = "Desenvolvedor";
"str.settings.about.translators" = "Tradutores";
"str.settings.about.showOnboarding" = "Repetir introdução do aplicativo";
"str.settings.loginQRcode.scan" = "Escanear QR-Code para login rápido";
"str.settings.simplifiedStockView" = "Visualização simplificada do estoque";
"str.settings.appLanguage" = "Idioma do aplicativo";
"str.settings.resetCache" = "Redefinir cache";
"str.settings.serverTimeoutInterval" = "Intervalo de tempo limite do servidor";
"str.settings.log" = "Log do aplicativo";
"str.settings.log.empty" = "Nenhuma entrada de log encontrada.";
"str.settings.log.update" = "Log de atualizações";
"str.settings.log.share" = "Compartilhar log";
"str.settings.grocy" = "Configurações do Grocy";
"str.settings.app" = "Configurações do aplicativo";
"str.settings.app.quickScan" = "Configurações do QuickScan";
"str.settings.app.quickScan.actionAfterAdd" = "Executar ação selecionada após atribuir um código de barras";
"str.settings.app.update" = "Configurações de atualização";
"str.settings.app.update.autoReload" = "Recarregar automaticamente em caso de alterações externas";
"str.settings.app.update.autoReload.interval" = "Intervalo de recarregamento";
"str.settings.stock" = "Configurações de estoque";
"str.settings.stock.presets" = "Predefinições para novos produtos";
"str.settings.stock.presets.location" = "Localização";
"str.settings.stock.presets.productGroup" = "Grupo de produto";
"str.settings.stock.presets.quantityUnit" = "Unidade de quantidade";
"str.settings.stock.presets.defaultDueDays" = "Dias de vencimento padrão";
"str.settings.stock.presets.treatOpenedAsOutOfStock" = "Tratar aberto como fora de estoque";
"str.settings.stock.stockOverview" = "Visão geral do estoque";
"str.settings.stock.stockOverview.dueSoonDays" = "Dias próximos ao vencimento";
"str.settings.stock.stockOverview.showIconShoppingList" = "Mostrar ícone se o produto já estiver na lista de compras";
"str.settings.stock.purchase" = "Comprar";
"str.settings.stock.purchase.defaultAmount" = "Quantidade padrão para compra";
"str.settings.stock.purchase.showPurchasedDate" = "Mostrar data de compra na página de compra e inventário (caso contrário, a data de compra será definida como hoje)";
"str.settings.stock.purchase.showWarningWhenEarlier" = "Mostrar um aviso quando a data de vencimento do produto comprado for anterior à próxima data de vencimento em estoque";
"str.settings.stock.consume" = "Consumir";
"str.settings.stock.consume.defaultAmount" = "Quantidade padrão para consumo";
"str.settings.stock.consume.useQuickConsume" = "Usar a \"Quantidade de consumo rápida\" do produto";
"str.settings.stock.common" = "Comum";
"str.settings.stock.common.amountDecimalPlaces" = "Casas decimais permitidas para quantidades";
"str.settings.stock.common.priceDecimalPlaces" = "Casas decimais permitidas para preços";
"str.settings.stock.common.priceDecimalPlacesInput" = "Casas decimais permitidas para preços (entrada)";
"str.settings.stock.common.priceDecimalPlacesDisplay" = "Casas decimais permitidas para preços (exibição)";
"str.settings.stock.common.priceAddSeparatorAuto" = "Adicionar separador decimal automaticamente para entradas de preço";
"str.settings.stock.common.priceAddSeparatorAuto.hint" = "Quando habilitado, você sempre deve inserir o valor incluindo casas decimais, o separador decimal será adicionado automaticamente com base na quantidade de casas decimais permitidas";
"str.settings.shoppingList" = "Configurações da lista de compras";
"str.settings.shoppingList.shoppingList" = "Lista de compras";
"str.settings.shoppingList.autoAddToShL" = "Adicionar automaticamente produtos que estão abaixo de sua quantidade mínima definida à lista de compras";
"str.settings.shoppingList.shLToStockWF" = "Fluxo de trabalho da lista de compras para o estoque";
"str.settings.shoppingList.autoAddToStock" = "Realizar automaticamente a reserva usando o último preço e a quantidade do item da lista de compras, se o produto tiver a opção \"Dias de vencimento padrão\" definida";


// MARK: - Admin
"str.admin.user" = "Gerenciamento de Usuários";
"str.admin.user.empty" = "Nenhum usuário encontrado";
"str.admin.user.tooltip.edit" = "Editar este item";
"str.admin.user.tooltip.permissions" = "Configurar permissões do usuário";
"str.admin.user.tooltip.delete" = "Excluir este item";
"str.admin.user.delete.question" = "Você realmente deseja excluir este usuário?";
"str.admin.user.new" = "Novo usuário";
"str.admin.user.new.create" = "Criar usuário";
"str.admin.user.new.edit" = "Editar usuário";
"str.admin.user.new.userName" = "Nome de Usuário";
"str.admin.user.new.userName.required" = "É necessário um nome de usuário";
"str.admin.user.new.userName.exists" = "Nome de usuário já existe";
"str.admin.user.new.firstName" = "Primeiro nome";
"str.admin.user.new.lastName" = "Último nome";
"str.admin.user.new.password" = "Senha";
"str.admin.user.new.password.confirm" = "Confirmação de senha";
"str.admin.user.new.password.mismatch" = "Senhas não conferem";

// MARK: - Quick Scan
"str.quickScan.consume" = "Consumir";
"str.quickScan.markAsOpened" = "Abrir";
"str.quickScan.purchase" = "Comprar";
"str.quickScan.input.consume.amount" = "Quantidade a consumir";
"str.quickScan.input.consume.default %@" = "Padrão (%@)";
"str.quickScan.input.consume.barcodeAmount %@" = "Rápido (%@)";
"str.quickScan.input.consume.custom" = "Personalizado";
"str.quickScan.input.consume.all %@" = "Tudo (%@)";
"str.quickScan.input.info.stockAmount %@" = "Quantidade em estoque: %@";
"str.quickScan.add.product" = "Produto para este código de barras";
"str.quickScan.add.product.add" = "Adicionar código de barras";
"str.quickScan.add.product.add.success" = "Código de barras adicionado com sucesso";
"str.quickScan.add.product.add.fail" = "Falha ao adicionar o código de barras";
"str.quickScan.add.product.new.openfoodfacts" = "Criar novo produto com o Open Food Facts";
"str.quickScan.barcode.invalid" = "Código de barras inválido";

// MARK: - Onboarding
"str.onboard.start" = "Vamos iniciar!";
"str.onboard.grocy.title" = "grocy - ERP além da sua geladeira";
"str.onboard.grocy.subtitle" = "grocy é uma solução de gerenciamento de compras e de produtos para a casa, auto-hospedada e baseada na web.";
"str.onboard.app.title" = "Grocy para iOS/macOS";
"str.onboard.app.subtitle" = "Um aplicativo com design nativo, permitindo um uso confortável do Grocy em casa e em movimento.";

"str.login.info" = "Bem-vindo ao Grocy Mobile!\n\n Este é um aplicativo complementar, o que significa que você precisa ter acesso a uma instância em execução do Grocy (por exemplo, em seu servidor).\n Se você deseja apenas testar este aplicativo, pode usar um dos servidores de demonstração fornecidos pelo desenvolvedor do Grocy, Bernd Bestel. No entanto, não use o servidor de demonstração para seus dados, pois eles não são persistentes.";
"str.login.select" = "Selecione um tipo de servidor:";
"str.login.demoServer" = "Servidor de demonstração";
"str.login.demoServer %@" = "Servidor de demonstração: %@";
"str.login.demoServer.info" = "Selecione um servidor de demonstração:";
"str.login.demoServer.use" = "Usar servidor de demonstração";
"str.login.ownServer" = "Outro servidor";
"str.login.ownServer.qr" = "QR-escanear";
"str.login.ownServer.qr.info" = "Abra a página de chaves de API na interface web do Grocy. Se nenhuma chave estiver disponível, crie uma. Em seguida, clique no símbolo do QR para exibir o código e escaneá-lo com o aplicativo.";
"str.login.ownServer.manual" = "Entrada manual";
"str.login.ownServer.manual.serverURL" = "URL do servidor";
"str.login.ownServer.manual.serverURL.help" = "URL do servidor da sua instância do Grocy (se você estiver usando o Home Assistant Ingress, isso pode ser acessado clicando com o botão direito no REST API Browser na interface web)";
"str.login.ownServer.manual.APIKey" = "Chave de API válida";
"str.login.ownServer.manual.APIKey.help" = "Chave de API para o usuário que é exibido na página de gerenciamento de chaves de API. Se nenhuma existir, você precisará criar uma nova.";
"str.login.ownServer.manual.APIKey.create" = "Criar chave de API";
"str.login.ownServer.manual.login" = "Login";
"str.login.connect.fail" = "Falha na conexão com o servidor.";
"str.login.connect.fail.info %@ %@" = "Servidor: %@\n\n Erro: %@";
"str.login.connect.unsupportedVersion %@" = "A versão do servidor %@ não é atualmente suportada pelo aplicativo. Você pode usá-la de qualquer maneira, mas pode haver problemas.";
"str.login.connect.unsupportedVersion.confirm" = "Continuar mesmo assim";
"str.login.hassIngress.use" = "Usar Home Assistant Ingress";
"str.login.hassIngress.token" = "Token de Longa Duração para o Home Assistant";
"str.login.hassIngress.token.help" = "Este token deve ser gerado a partir da interface web do Home Assistant. Para fazer isso, abra a página de perfil do Home Assistant, role para baixo até Tokens de Acesso de Longa Duração e crie um. Dê um nome a ele e copie o token resultante para o aplicativo ou crie um código QR e o escaneie (iOS).";
